Revit 2015 API
BeamSystemTypeSet Class
A set that contains BeamSystem types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public class BeamSystemTypeSet : APIObject,
	IEnumerable
Visual Basic
Public Class BeamSystemTypeSet _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class BeamSystemTypeSet : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.BeamSystemTypeSet
See Also
BeamSystemTypeSet Members
Autodesk.Revit.DB Namespace